Revit 2026 API

# AnalysisDisplayStyleVectorOrientation Enumeration

---

Defines vector orientation for vector settings of analysis display style.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalysisDisplayStyleVectorOrientation
```
```vb
Public Enumeration AnalysisDisplayStyleVectorOrientation
```
```cpp
public enum class AnalysisDisplayStyleVectorOrientation
```
```fsharp
type AnalysisDisplayStyleVectorOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| ArcAroundVectorAxis | 1 |  |
| Linear | 0 |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace